# Command Processor v6 - Help Command

Write a console program that takes in a line of command each time and print the corresponding output, looping until the user quits.

If the user enters an invalid command, print help text.

If the user enters invalid parameters, output what went wrong, then print help text specific to the command issued. Note that if two or more specified error messages apply to one input, any one of the applicable error messages should be printed.

Print the following on program start:

```
Command Processor
Type 'quit' to exit

```

When prompting for user input, print `>` followed by a space for indication. After completing the output for a command, output a blank line before prompting for the next command.

**Commands to support**

- ping
- say
- add
- subtract
- help
- quit

## `ping`

Reply with `pong`.

Command-specific help text: `Usage: ping`

### Example

```
> ping
pong

```

## `say`

Re-print the string that follows the `say` keyword.

- If no text is provided after `say`, print `No text provided.`

Command-specific help text: `Usage: say <text>`

### Example

```
> say
No text provided.
Usage: say <text>

```

```
> say hello world!
hello world!

```

## `add`

Read the command in this format:

`add <decimal1> <decimal2>`

Then output the sum of the two numbers.

- If nothing is provided after `add`, print `No values provided.`
- If only one decimal is provided, print `Two values required.`
- If any of the values are not valid decimals, print `Invalid value.`

Command-specific help text: `Usage: add <decimal1> <decimal2>`

### Example

```
> add
No values provided.
Usage: add <decimal1> <decimal2>

```

```
> add 1 2
3

```

```
> add 1.11 2.34
3.45

```

## `subtract`

Read the command in this format:

`subtract <decimal1> <decimal2>`

Then output the difference between the two numbers.

- If nothing is provided after `subtract`, print `No values provided.`
- If only one decimal is provided, print `Two values required.`
- If any of the values are not valid decimals, print `Invalid value.`

Command-specific help text: `Usage: subtract <decimal1> <decimal2>`

### Example

```
> subtract
No values provided.
Usage: subtract <decimal1> <decimal2>

```

```
> subtract 1 2
-1

```

```
> subtract 2.34 1.11
1.23

```

## `help`

If a command name is supplied as optional parameter:

Print the corresponding command-specific help text.

Command-specific help text: `Usage: help [<command>]`

### Example

```
> help ping
Usage: ping

```

```
> help add
Usage: add <decimal1> <decimal2>

```

If no parameters are supplied:

Print a list of available commands in alphabetical order.

### Example

```
> help
add
help
ping
quit
say
subtract

```

## `quit`

Exit the program.

Command-specific help text: `Usage: quit`

## Invalid command

Print help text: `Command not recognized.`

## Example

```
Command Processor
Type 'quit' to exit

> ping
pong

> say
No text provided.
Usage: say <text>

> say abc
abc

> say Hello World!
Hello World!

> add 1
Two values required.
Usage: add <decimal1> <decimal2>

> add 1 2
3

> add 1.23 1.11
2.34

> subtract 2 1
1

> subtract 2.34 1.11
1.23

> abc
Command not recognized.

> quit
<program terminated>
```
