# Command Processor v8 - Whitelist Command

Write a console program that takes in a line of command each time and print the corresponding output, looping until the user quits.

If the user enters an invalid command, print help text.

If the user enters invalid parameters, output what went wrong, then print help text specific to the command issued. Note that if two or more specified error messages apply to one input, any one of the applicable error messages should be printed.

Print the following on program start:

```
Command Processor
Type 'quit' to exit

```

When prompting for user input, print `>` followed by a space for indication. After completing the output for a command, output a blank line before prompting for the next command.

**Commands to support**

- ping
- say
- add
- subtract
- blacklist
- whitelist
- help
- quit

## `ping`

Reply with `pong`.

Command-specific help text: `Usage: ping`

### Example

```
> ping
pong

```

## `say`

Re-print the string that follows the `say` keyword.

- If no text is provided after `say`, print `No text provided.`

Command-specific help text: `Usage: say <text>`

### Example

```
> say
No text provided.
Usage: say <text>

```

```
> say hello world!
hello world!

```

## `add`

Read the command in this format:

`add <decimal1> <decimal2>`

Then output the sum of the two numbers.

- If nothing is provided after `add`, print `No values provided.`
- If only one decimal is provided, print `Two values required.`
- If any of the values are not valid decimals, print `Invalid value.`

Command-specific help text: `Usage: add <decimal1> <decimal2>`

### Example

```
> add
No values provided.
Usage: add <decimal1> <decimal2>

```

```
> add 1 2
3

```

```
> add 1.11 2.34
3.45

```

## `subtract`

Read the command in this format:

`subtract <decimal1> <decimal2>`

Then output the difference between the two numbers.

- If nothing is provided after `subtract`, print `No values provided.`
- If only one decimal is provided, print `Two values required.`
- If any of the values are not valid decimals, print `Invalid value.`

Command-specific help text: `Usage: subtract <decimal1> <decimal2>`

### Example

```
> subtract
No values provided.
Usage: subtract <decimal1> <decimal2>

```

```
> subtract 1 2
-1

```

```
> subtract 2.34 1.11
1.23

```

## `blacklist`

This is a command with multiple sub-commands. The string after the first space and before the second space in the input represents the sub-command name. If the user input matches a sub-command, execute that sub-command and report errors specific to that sub-command. Otherwise, list the command-specific help text for all sub-commands in alphabetical order:

```
> blacklist
Usage: blacklist add <name>
Usage: blacklist clear
Usage: blacklist list
Usage: blacklist remove <name>

```

```
> blacklist help
Usage: blacklist add <name>
Usage: blacklist clear
Usage: blacklist list
Usage: blacklist remove <name>

```

**Sub-commands**

- add
- remove
- list
- clear

### `blacklist add`

Read the command in this format:

`blacklist add <name>`

`<name>` must consist of alphanumeric characters or underscore only.

Store the provided name in a list and print `<name> added to blacklist.`

- If nothing is provided after `blacklist add`, print `No name provided.`
- If the name contains invalid characters, print `Invalid name.`

Command-specific help text: `Usage: blacklist add <name>`

#### Example

```
> blacklist add player
player added to blacklist.

```

```
> blacklist add test player
Invalid name.
Usage: blacklist add <name>

```

```
> blacklist add
No name provided.
Usage: blacklist add <name>

```

### `blacklist remove`

Read the command in this format:

`blacklist remove <name>`

`<name>` must consist of alphanumeric characters or underscore only.

Check if the provided name exist in the list. If yes, remove it and output `<name> removed from blacklist.` Otherwise, output `<name> is not in the blacklist.` Note that in both cases, the command is considered to have executed successfully, thus the command-specific help text need not be printed.

- If nothing is provided after `blacklist remove`, print `No name provided.`
- If the name contains invalid characters, print `Invalid name.`

Command-specific help text: `Usage: blacklist remove <name>`

#### Example

```
> blacklist add player
player added to blacklist.

> blacklist remove player
player removed from blacklist.

```

```
> blacklist remove player
player is not in the blacklist.

```

```
> blacklist remove test player
Invalid name.
Usage: blacklist remove <name>

```

```
> blacklist remove
No name provided.
Usage: blacklist remove <name>

```

### `blacklist list`

Print all saved names line-by-line. If the list is empty, print `Blacklist is empty.`

Command-specific help text: `Usage: blacklist list`

#### Example

```
> blacklist add player
player added to blacklist.

> blacklist add player2
player2 added to blacklist.

> blacklist list
player
player2

```

```
> blacklist list
Blacklist is empty.

```

### `blacklist clear`

Clear the list and print `Blacklist cleared.` regardless if the list was originally empty or not.

Command-specific help text: `Usage: blacklist clear`

#### Example

```
> blacklist clear
Blacklist cleared.

```

## `whitelist`

This is a command with multiple sub-commands. The string after the first space and before the second space in the input represents the sub-command name. If the user input matches a sub-command, execute that sub-command and report errors specific to that sub-command. Otherwise, list the command-specific help text for all sub-commands in alphabetical order:

```
> whitelist
Usage: whitelist add <name>
Usage: whitelist clear
Usage: whitelist list
Usage: whitelist remove <name>

```

```
> whitelist help
Usage: whitelist add <name>
Usage: whitelist clear
Usage: whitelist list
Usage: whitelist remove <name>

```

**Sub-commands**

- add
- remove
- list
- clear

### `whitelist add`

Read the command in this format:

`whitelist add <name>`

`<name>` must consist of alphanumeric characters or underscore only.

Store the provided name in a list and print `<name> added to whitelist.`

- If nothing is provided after `whitelist add`, print `No name provided.`
- If the name contains invalid characters, print `Invalid name.`

Command-specific help text: `Usage: whitelist add <name>`

#### Example

```
> whitelist add player
player added to whitelist.

```

```
> whitelist add test player
Invalid name.
Usage: whitelist add <name>

```

```
> whitelist add
No name provided.
Usage: whitelist add <name>

```

### `whitelist remove`

Read the command in this format:

`whitelist remove <name>`

`<name>` must consist of alphanumeric characters or underscore only.

Check if the provided name exist in the list. If yes, remove it and output `<name> removed from whitelist.` Otherwise, output `<name> is not in the whitelist.` Note that in both cases, the command is considered to have executed successfully, thus the command-specific help text need not be printed.

- If nothing is provided after `whitelist remove`, print `No name provided.`
- If the name contains invalid characters, print `Invalid name.`

Command-specific help text: `Usage: whitelist remove <name>`

#### Example

```
> whitelist add player
player added to whitelist.

> whitelist remove player
player removed from whitelist.

```

```
> whitelist remove player
player is not in the whitelist.

```

```
> whitelist remove test player
Invalid name.
Usage: whitelist remove <name>

```

```
> whitelist remove
No name provided.
Usage: whitelist remove <name>

```

### `whitelist list`

Print all saved names line-by-line. If the list is empty, print `Whitelist is empty.`

Command-specific help text: `Usage: whitelist list`

#### Example

```
> whitelist add player
player added to whitelist.

> whitelist add player2
player2 added to whitelist.

> whitelist list
player
player2

```

```
> whitelist list
whitelist is empty.

```

### `whitelist clear`

Clear the list and print `Whitelist cleared.` regardless if the list was originally empty or not.

Command-specific help text: `Usage: whitelist clear`

#### Example

```
> whitelist clear
whitelist cleared.

```

## `help`

If a command name is supplied as optional parameter:

Print the corresponding command-specific help text.

Command-specific help text: `Usage: help [<command>]`

### Example

```
> help ping
Usage: ping

```

```
> help add
Usage: add <decimal1> <decimal2>

```

If no parameters are supplied:

Print a list of available commands in alphabetical order.

### Example

```
> help
add
help
ping
quit
say
subtract

```

## `quit`

Exit the program.

Command-specific help text: `Usage: quit`

## Invalid command

Print help text: `Command not recognized.`

## Combined Example

```
Command Processor
Type 'quit' to exit

> ping
pong

> say
No text provided.
Usage: say <text>

> say abc
abc

> say Hello World!
Hello World!

> add 1
Two values required.
Usage: add <decimal1> <decimal2>

> add 1 2
3

> add 1.23 1.11
2.34

> subtract 2 1
1

> subtract 2.34 1.11
1.23

> blacklist add player
player added to blacklist.

> blacklist remove player
player removed from blacklist.

> blacklist add player 1
Invalid name.
Usage: blacklist add <name>

> blacklist add player1
player1 added to blacklist.

> blacklist add player2
player2 added to blacklist.

> blacklist list
player1
player2

> blacklist clear
Blacklist cleared.

> blacklist remove player1
player1 is not in the blacklist.

> whitelist add player
player added to whitelist.

> whitelist remove player
player removed from whitelist.

> whitelist add player 1
Invalid name.
Usage: whitelist add <name>

> whitelist add player1
player1 added to whitelist.

> whitelist add player2
player2 added to whitelist.

> whitelist list
player1
player2

> whitelist clear
Whitelist cleared.

> whitelist remove player1
player1 is not in the whitelist.

> abc
Command not recognized.

> help add
Usage: add <decimal1> <decimal2>

> help
add
help
ping
quit
say
subtract

> quit
<program terminated>
```
